{"testimony":"If you have been blessed by the Most-High through Sabbath Keepers Fellowship, please include a short 1 to 2 paragraph testimonial to that effect for use on our website and other outreaches we have to the people who support us. They care and want to see you to know how their efforts are used. Thank you, from us and all of them.","florida":"Shalom, my friend, \n\nAs of 2\/10\/2025, no materials from Sabbath Keepers Fellowship will be going out to the over 2,000 Sabbath-keeping inmates we serve in Florida, and have served since 1996. This includes all of our items: books, bibles, newsletters, calendar, garments, articles and teachings, as well as our annual Passover Package Program materials. This is not our choice, but that of the Florida Department of Corrections.\n\nIn a recent ruling, the Literature Review Committee, part of the FDC’s Central Committee, has banned our Freedom’s Call newsletter to be let into the prison system because it contains Hebrew language material. This same newsletter, with all of our chaplaincy and inmate order forms, has been going into Florida prisons virtually unchanged for over 20 years. It is the primary vehicle we use to offer our services to chaplains and inmates nationwide. Because it contains Hebrew language, it will no longer be allowed because Florida’s Literature Review Committee says: \n\n“The publication was rejected by the Literature Review Committee for reason 15 (F) which states “the publication is written in code or otherwise written in a manner that is not reasonably subject to interpretation by Dept staff as to meaning or intent.”\n\nIt should be known that other religions in the FDC, such as Orthodox Jews and the Hebrew Israelites, are allowed Hebrew language without discrimination because they have grievanced and won lawsuits against the Department for the same or similar reasons. \n\nWe apologize for not being able to serve you at present, especially as we are making our last arrangements for our annual Passover Package program. Know that we will be doing our best to resolve this issue to everyone’s benefit as quickly as possible. If you have any similar issues with rejection, please contact us and provide proof, in order to help rectify this matter more quickly. We thank you for your understanding, and also for doing all that you can do yourselves to help us correct this issue, under these present circumstances.\n\nWith love in Messiah,\nLisa Haufler\nExecutive Director, Sabbath Keepers Fellowship"}
